{
    "question": [
        {
            "post": "What are the political implications of millions of Japanese men dropping out of society?",
            "replies": [
                ">>449787526The implication is that white Americans like myself have and will move here and make a better life than these Japanese men could ever do. I like Japanese, including the guys but they basically fall into four categories. Wage slave normie cuck, withdraw otaku who never engaged with peers or bettered themself, chad who is too busy hanging out with male friends to find a mate, and feminine guy that probably actually gets more girls than the other three. When I first came here I had no interest in Japanese girls but after years of them just throwing themselves at me because ninety percent of dudes are one of the four types I slowly succumbed to appreciating the women and I am now married with multiple kids with a pretty good job a d a bright future. Not sure why the indigenous men cannot make a good life in this society but I think there is something wrong with the way they operate on a social level.",
                ">>449787913Why did you initially go to Japan? How long did it take you to learn the language enough to communicate effectively?",
                ">>449787913I hope a mob of Japanese nationalists crucify you fucking sexpat.",
                ">>449787913Youre a disgrace. No better than a nigger.Your ancestors spit on you.",
                ">>449787526it's all true, but these conditions are present in the west. We can factor out all of this and there's no longer anything distinct about Japan. Why even complain at this point?",
                ">>449788038I was a journalist and I originally went because I was assigned here.>>449788473I don’t think I’m so bad. I never wanted to take advantage of the easy women here and now that I am married with kids I turn down tons of advances. I think that I actually am quite a good Japanese citizen by staying and marrying the woman I knocked up and then creating a family with her.The point I want to get across is that unlike a lot of western countries in which the media and other factors are to blame for the state of society, here in Japan it is almost exclusively the men who are to blame. They became weak, feminine, and the few that are strong just become wage slaves because they have no spine or else ignore women and just spend their time hanging with bros. Japan is one of the few countries in the world where a man can still be conservative and traditional and make something of himself and yet the men here would rather just be a bunch of losers",
                ">>449789076>They became weak, feminineWhat lead to this? The Japs are not living life in easy mode, not as lazy as all other races, it's usually too much leisure that sissifies men",
                ">>449789302Maybe vanity? The ones who are not otaku and addicted to the childish media are either cool dudes who will almost likely be single forever, normalfag wageslaves, and feminine guys. Other than the otaku they all seem interesting in just projecting something instead of simply existing as a real person. Very few Japanese in my experience seem to be genuine, women and men. For women that’s mostly okay because they just act and look cute but for guys they just become this weird hollow shell that lives life vapidly and does not seek out any substance which is probably why the have a declining birth rate. Thank god for the wagecucks I guess but I feel bad for them.",
                ">>449790043People are heavily addicted to phones I guess, I wonder if Tinder is available in Japan and how bad it fucked them up",
                ">>449790043I've spoken to Japs all day long for years>t.senseiThey feel powerless, but the worst part is, they're just not inquisitive people. They loathe to answer any 'why' question. So there's no point trying to unravel the Japanese mystique as an outsider, the insiders have no idea why they do the things they do.",
                ">>449787526i think my favorite part of how he thinks western women are more fair. kek.its like a weebs perspective of \"holy Nippon\"i guess the thot-pocolypse is a global issueonly niggers are equipped to handle it because they have no shame and never wanted families anyway",
                ">>449790504>i think my favorite part of how he thinks western women are more fair. kek.The men of the race know their women's darkest natures best.",
                ">>449787526This is already happening worldwide. The juice really isn't worth the squeeze.",
                ">>449788473>>449788180seething femoids",
                ">>449787526japan will import negros to do the work>japan is doomed>kek",
                ">>449787526it's honestly piss easy.is there a good motivation to participate in society? then people will participate in society.is there no motivation to participate in society? then people won't.",
                ">>449787526God, this just feels like a concentrated version of everywhere else. If Humanity survives feminism, I hope we all remember how damaging it is to give women any sort of freedom and power.",
                ">>449787913>The implication is that white Americans like myself have and will move here and make a better life than these Japanese men could ever doyou sound like those boat niggers in the med sea",
                ">>449787526Tfw slutty jap femdom gf",
                ">>449792401nothing wrong with moving to another country if you follow the law anon"
            ]
        }
    ],
    "none_question": [
        {
            "post": "Finland can't stop the negro on bicycle HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA RUSSIA WON 3RD TIME",
            "replies": [
                ">>449784485Just doze them with a water hose. That’s what Poland did and it turned out to be effective.",
                ">>449784557You don't get it do you? Our government WANTS THEM and will OBEY EU/UN they will never close borders",
                ">>449784485What would Sanna do?",
                ">>449784485Most of them want to fuck off as soon as winter hits and they realize we're genuinely rasict. The gibs are so shit they take jobs delivering food until they fuck off back to central EuropeIt's the mudshits that stay because they have their kebab community to fall on",
                ">>449784485>A dozen browns coming from the east: bad>Countless millions of browns coming from the south: good",
                ">>449786720Probably close the borders.",
                ">>449784485nigga stole my bike",
                ">>449784936Neoliberalism requires cheap immigrant labor to function.",
                ">>449784485Type F for Finland.F.",
                ">>449787094",
                ">>449784557thats what north dakota did to the prairie niggers while they were chimping out over a pipeline. it was so based watching those shitskins get blasted with water when it was 00f",
                ">>449786720Friday night party with slutty dress and dances",
                ">>449786720Arrange private planes and fly them here.",
                ">>449786720Snort a BBC-sized line of coke out of her bull's dick while her cuck husband takes care of the kids back at home.",
                ">>449786720BBC party in all her holes",
                ">>449786720fuck every one of them with her husband holding the baby and watching.",
                ">>449784485lol the nigga with training wheels",
                ">>449784485because of some weird rules, you are not allowed to cross the border on foot, so they they supplied with stolen bikes from the ruskies and cycle over the border.same thing happens here.",
                ">>449788148>because of some weird rules, you are not allowed to cross the border on foot, so they they supplied with stolen bikes from the ruskies and cycle over the border.That's not true. Why would it be illegal to do it on foot but not on bike? sounds like right wing propaganda",
                ">>449788148this is hilarious",
                ">>449788148Highway is open so why walk they have already housing here they're kicking out people who came from Ukraine and giving those apartments for this people LOL Ukraine cucked forever",
                ">>449788283Because they wrote the law in a stupid way and jewish lawyers defending the invaders found out they could legally cross on bikes but not on foot.",
                ">>449787595Meanwhile Orpu will give them low-wage jobs which will make your wages drop, then give tax cuts to the rich.",
                "Some guy from Sweden provided stats and it turned out there were like 200 immigrants from Russia and 20000 from elsewhere or something. Of course, not one mentions these 20000, just the 200 that migrated via Russia.I thought Russians were based but then it turned out to be another Russia derangment syndrome mentally ill fantasy (like Russian interference in elections).",
                "Is Sauli still kissing Netanyahu's ass?",
                ">>449788809pretty much this, its a loophole in the law. its been expolited for years, especially in 2015 when 5000 \"syrains\" came through the russa/norway border on bikes.they were bussed to the border and bought the bikes. then crossed.i dont remember what the law says, but you can't walk or drive over the border, but bike is a loophole. you dont even have to be on the bike, you can just push it along.its been years, and no one has done anything about this rule.",
                ">>449788985Guess?",
                "I find it funny how Americans say about \"spics\" when Keynes classified Americans as sub or super dagos 100 years ago, long before there was much Latin immigration.The Americans were the spics all along.",
                ">>449784485Diversity is strength",
                ">>449787092Then go back to riding a BWC",
                ">>449784485Yeah, this was all a ruse to militarize the border for ZOG. Our traitor government must be destroyed. NATO must be destroyed. Every single traitor must burn.NATOWILLBURN"
            ]
        }
    ]
}